{"class_name": "Sequential", "config": {"name": "sequential_2", "layers": [{"class_name": "DenseFeatures", "config": {"name": "dense_features", "trainable": true, "dtype": "float32", "feature_columns": [{"class_name": "NumericColumn", "config": {"key": "ARI", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "Incorrect_form_ratio", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "av_word_per_sen", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "coherence_score", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "dale_chall_readability_score", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "flesch_kincaid_grade", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "flesch_reading_ease", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "freq_diff_words", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "freq_of_adj", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "freq_of_adv", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "freq_of_distinct_adj", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "freq_of_distinct_adv", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "freq_of_noun", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "freq_of_pronoun", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "freq_of_transition", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "freq_of_verb", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "freq_of_wrong_words", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "lexrank_avg_min_diff", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "lexrank_interquartile", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "mcalpine_eflaw", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "noun_to_adj", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "num_of_grammar_errors", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "num_of_short_forms", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "number_of_diff_words", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "number_of_words", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "phrase_diversity", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "punctuations", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "sentence_complexity", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "sentiment_compound", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "sentiment_negative", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "sentiment_positive", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "stopwords_frequency", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "text_standard", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "ttr", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "verb_to_adv", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}], "partitioner": null}}, {"class_name": "Dense", "config": {"name": "Hidden0", "trainable": true, "dtype": "float32", "units": 30, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "Hidden1", "trainable": true, "dtype": "float32", "units": 12, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "Output", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}], "build_input_shape": {"number_of_words": [null], "stopwords_frequency": [null], "av_word_per_sen": [null], "punctuations": [null], "ARI": [null], "freq_of_verb": [null], "freq_of_adj": [null], "freq_of_adv": [null], "freq_of_distinct_adj": [null], "freq_of_distinct_adv": [null], "sentence_complexity": [null], "freq_of_wrong_words": [null], "sentiment_compound": [null], "sentiment_positive": [null], "sentiment_negative": [null], "num_of_grammar_errors": [null], "corrected_text": [null], "num_of_short_forms": [null], "Incorrect_form_ratio": [null], "flesch_reading_ease": [null], "flesch_kincaid_grade": [null], "dale_chall_readability_score": [null], "text_standard": [null], "mcalpine_eflaw": [null], "number_of_diff_words": [null], "freq_diff_words": [null], "ttr": [null], "coherence_score": [null], "lexrank_avg_min_diff": [null], "lexrank_interquartile": [null], "freq_of_noun": [null], "freq_of_transition": [null], "freq_of_pronoun": [null], "noun_to_adj": [null], "verb_to_adv": [null], "phrase_diversity": [null], "cohesion": [null]}}, "keras_version": "2.9.0", "backend": "tensorflow"}